#+title: Computer Science Tools

[[file:../../homepage.org][Homepage]] / [[file:../../notes.org][Notes]] / [[file:../computer-science.org][Computer Science]] / Tools

*** httpie
#+begin_src bash :results verbatim
https httpie.io/hello
#+end_src

#+RESULTS:
: {"ahoy":["Hello, World! 👋 Thank you for trying out HTTPie 🥳","We hope this will become a friendship."],"links":{"homepage":"https://httpie.io","twitter":"https://twitter.com/httpie","discord":"https://httpie.io/discord","github":"https://github.com/httpie"}}
*** httpbin
Returns client's headers
#+begin_src bash :results verbatim
curl https://httpbin.org/headers
#+end_src

#+RESULTS:
: {
:   "headers": {
:     "Accept": "*/*",
:     "Host": "httpbin.org",
:     "User-Agent": "curl/7.77.0",
:     "X-Amzn-Trace-Id": "Root=1-618168b4-0982f80d2e2330516e6d3566"
:   }
: }
** Makefiles
#+begin_src makefile :tangle ~/tmp/makefile_tutorial/Makefile :results none
hello:
	echo "hello world"
#+end_src

#+begin_src bash :results output
cd ~/tmp/makefile_tutorial && make
#+end_src

#+RESULTS:
: echo "hello world"
: hello world

#+begin_src makefile :tangle ~/tmp/makefile_tutorial/Makefile :results none
hello: dependency
	echo "hello world"

dependency:
	echo "run dependency first"
#+end_src

#+begin_src bash :results output
cd ~/tmp/makefile_tutorial && make
#+end_src

#+RESULTS:
: echo "run dependency first"
: run dependency first
: echo "hello world"
: hello world

